espressif/arduino-esp32/libraries/BLE/src/BLERemoteCharacteristic.cpp
  // Check to see that we are connected.
  if (!getRemoteService()->getClient()->isConnected()) {
    log_e("Disconnected");
    return false;
  }

  m_semaphoreWriteCharEvt.take("writeValue");
  // Invoke the ESP-IDF API to perform the write.
  esp_err_t errRc = ::esp_ble_gattc_write_char(
    m_pRemoteService->getClient()->getGattcIf(), m_pRemoteService->getClient()->getConnId(), getHandle(), length, data,
    response ? ESP_GATT_WRITE_TYPE_RSP : ESP_GATT_WRITE_TYPE_NO_RSP, (esp_gatt_auth_req_t)m_auth
  );

  if (errRc != ESP_OK) {
    log_e("esp_ble_gattc_write_char: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }

  m_semaphoreWriteCharEvt.wait("writeValue");

  log_v("<< writeValue");
  return true;
}  // writeValue

#endif

/***************************************************************************
 *                           NimBLE functions                              *
 ***************************************************************************/

#if defined(CONFIG_NIMBLE_ENABLED)

/**
 * @brief Constructor.
 * @param [in] reference to the service this characteristic belongs to.
 * @param [in] ble_gatt_chr struct defined as:
 *  struct ble_gatt_chr {
 *      uint16_t def_handle;
 *      uint16_t val_handle;
 *      uint8_t properties;
 *      ble_uuid_any_t uuid;
 *  };
 */
BLERemoteCharacteristic::BLERemoteCharacteristic(BLERemoteService *pRemoteService, const struct ble_gatt_chr *chr) {
  log_v(">> BLERemoteCharacteristic()");
  switch (chr->uuid.u.type) {
    case BLE_UUID_TYPE_16:  m_uuid = BLEUUID(chr->uuid.u16.value); break;
    case BLE_UUID_TYPE_32:  m_uuid = BLEUUID(chr->uuid.u32.value); break;
    case BLE_UUID_TYPE_128: m_uuid = BLEUUID(const_cast<ble_uuid128_t *>(&chr->uuid.u128)); break;
    default:                break;
  }

  m_handle = chr->val_handle;
  m_defHandle = chr->def_handle;
  m_endHandle = 0;
  m_charProp = chr->properties;
  m_pRemoteService = pRemoteService;
  m_notifyCallback = nullptr;
  m_rawData = nullptr;
  m_auth = 0;

  retrieveDescriptors();  // Get the descriptors for this characteristic

  log_v("<< BLERemoteCharacteristic(): %s", m_uuid.toString().c_str());
}  // BLERemoteCharacteristic

/**
 * @brief Callback used by the API when a descriptor is discovered or search complete.
 */
int BLERemoteCharacteristic::descriptorDiscCB(
  uint16_t conn_handle, const struct ble_gatt_error *error, uint16_t chr_val_handle, const struct ble_gatt_dsc *dsc, void *arg
) {
  int rc = error->status;
  log_d("Descriptor Discovered >> status: %d handle: %d", rc, (rc == 0) ? dsc->handle : -1);

  desc_filter_t *filter = (desc_filter_t *)arg;
  const BLEUUID *uuid_filter = filter->uuid;
  ble_task_data_t *pTaskData = (ble_task_data_t *)filter->task_data;
  BLERemoteCharacteristic *characteristic = (BLERemoteCharacteristic *)pTaskData->pATT;

  if (characteristic->getRemoteService()->getClient()->getConnId() != conn_handle) {
    return 0;
  }

  switch (rc) {
    case 0:
    {
      if (uuid_filter != nullptr) {
        if (ble_uuid_cmp(&uuid_filter->getNative()->u, &dsc->uuid.u) != 0) {
          return 0;
        } else {
          rc = BLE_HS_EDONE;
        }
      }

      BLERemoteDescriptor *pNewRemoteDescriptor = new BLERemoteDescriptor(characteristic, dsc);
      characteristic->m_descriptorMap.insert(
        std::pair<std::string, BLERemoteDescriptor *>(pNewRemoteDescriptor->getUUID().toString().c_str(), pNewRemoteDescriptor)
      );
      break;
    }
    default: break;
  }

  /*  If rc == BLE_HS_EDONE, resume the task with a success error code and stop the discovery process.
   *  Else if rc == 0, just return 0 to continue the discovery until we get BLE_HS_EDONE.
   *  If we get any other error code tell the application to abort by returning non-zero in the rc.
   */
  if (rc == BLE_HS_EDONE) {
    pTaskData->rc = 0;
    xTaskNotifyGive(pTaskData->task);
  } else if (rc != 0) {
    // Error; abort discovery.
    pTaskData->rc = rc;
    xTaskNotifyGive(pTaskData->task);
  }

  log_d("<< Descriptor Discovered. status: %d", pTaskData->rc);
  return rc;
}

/**
 * @brief callback from NimBLE when the next characteristic of the service is discovered.
 */
int BLERemoteCharacteristic::nextCharCB(uint16_t conn_handle, const struct ble_gatt_error *error, const struct ble_gatt_chr *chr, void *arg) {
  int rc = error->status;
  log_d("Next Characteristic >> status: %d handle: %d", rc, (rc == 0) ? chr->val_handle : -1);

  ble_task_data_t *pTaskData = (ble_task_data_t *)arg;
  BLERemoteCharacteristic *pChar = (BLERemoteCharacteristic *)pTaskData->pATT;

  if (pChar->getRemoteService()->getClient()->getConnId() != conn_handle) {
    return 0;
  }

  if (rc == 0) {
    pChar->m_endHandle = chr->def_handle - 1;
    rc = BLE_HS_EDONE;
  } else if (rc == BLE_HS_EDONE) {
    pChar->m_endHandle = pChar->getRemoteService()->getEndHandle();
  } else {
    pTaskData->rc = rc;
  }

  xTaskNotifyGive(pTaskData->task);
  return rc;
}

/**
 * @brief Callback for characteristic read operation.
 * @return success == 0 or error code.
 */
int BLERemoteCharacteristic::onReadCB(uint16_t conn_handle, const struct ble_gatt_error *error, struct ble_gatt_attr *attr, void *arg) {
  ble_task_data_t *pTaskData = (ble_task_data_t *)arg;
  BLERemoteCharacteristic *characteristic = (BLERemoteCharacteristic *)pTaskData->pATT;
  uint16_t conn_id = characteristic->getRemoteService()->getClient()->getConnId();

  if (conn_id != conn_handle) {
    return 0;
  }

  log_i("Read complete; status=%d conn_handle=%d", error->status, conn_handle);

  String *strBuf = (String *)pTaskData->buf;
  int rc = error->status;

  if (rc == 0) {
    if (attr) {
      uint32_t data_len = OS_MBUF_PKTLEN(attr->om);
      if (((*strBuf).length() + data_len) > BLE_ATT_ATTR_MAX_LEN) {
        rc = BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
      } else {
        log_i("Got %d bytes", data_len);
        (*strBuf) += String((char *)attr->om->om_data, data_len);
        return 0;
      }
    }
  }

  pTaskData->rc = rc;
  xTaskNotifyGive(pTaskData->task);

