espressif/arduino-esp32/libraries/BLE/src/BLERemoteCharacteristic.cpp
  return rc;
}

/**
 * @brief Callback for characteristic write operation.
 * @return success == 0 or error code.
 */
int BLERemoteCharacteristic::onWriteCB(uint16_t conn_handle, const struct ble_gatt_error *error, struct ble_gatt_attr *attr, void *arg) {
  ble_task_data_t *pTaskData = (ble_task_data_t *)arg;
  BLERemoteCharacteristic *characteristic = (BLERemoteCharacteristic *)pTaskData->pATT;

  if (characteristic->getRemoteService()->getClient()->getConnId() != conn_handle) {
    return 0;
  }

  log_i("Write complete; status=%d conn_handle=%d", error->status, conn_handle);

  pTaskData->rc = error->status;
  xTaskNotifyGive(pTaskData->task);

  return 0;
}

/**
 * @brief Populate the descriptors (if any) for this characteristic.
 * @param [in] the end handle of the characteristic, or the service, whichever comes first.
 */
bool BLERemoteCharacteristic::retrieveDescriptors(const BLEUUID *uuid_filter) {
  log_d(">> retrieveDescriptors() for characteristic: %s", getUUID().toString().c_str());

  // If this is the last handle then there are no descriptors
  if (m_handle == getRemoteService()->getEndHandle()) {
    return true;
  }

  int rc = 0;
  TaskHandle_t cur_task = xTaskGetCurrentTaskHandle();
  ble_task_data_t taskData = {this, cur_task, 0, nullptr};

  // If we don't know the end handle of this characteristic retrieve the next one in the service
  // The end handle is the next characteristic definition handle -1.
  if (m_endHandle == 0) {
    rc = ble_gattc_disc_all_chrs(
      getRemoteService()->getClient()->getConnId(), m_handle, getRemoteService()->getEndHandle(), BLERemoteCharacteristic::nextCharCB, &taskData
    );
    if (rc != 0) {
      log_e("Error getting end handle rc=%d", rc);
      return false;
    }

#ifdef ulTaskNotifyValueClear
    // Clear the task notification value to ensure we block
    ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

    if (taskData.rc != 0) {
      log_e("Could not retrieve end handle rc=%d", taskData.rc);
      return false;
    }
  }

  if (m_handle == m_endHandle) {
    return true;
  }

  desc_filter_t filter = {uuid_filter, &taskData};

  rc = ble_gattc_disc_all_dscs(getRemoteService()->getClient()->getConnId(), m_handle, m_endHandle, BLERemoteCharacteristic::descriptorDiscCB, &filter);

  if (rc != 0) {
    log_e("ble_gattc_disc_all_dscs: rc=%d %s", rc, BLEUtils::returnCodeToString(rc));
    return false;
  }

#ifdef ulTaskNotifyValueClear
  // Clear the task notification value to ensure we block
  ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif
  ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

  if (taskData.rc != 0) {
    log_e("Failed to retrieve descriptors; startHandle:%d endHandle:%d taskData.rc=%d", m_handle, m_endHandle, taskData.rc);
  }

  log_d("<< retrieveDescriptors(): Found %d descriptors.", m_descriptorMap.size());
  return (taskData.rc == 0);
}  // retrieveDescriptors

/**
 * @brief Read the value of the remote characteristic.
 * @return The value of the remote characteristic.
 */
String BLERemoteCharacteristic::readValue() {
  log_d(">> readValue(): uuid: %s, handle: %d 0x%.2x", getUUID().toString().c_str(), getHandle(), getHandle());

  BLEClient *pClient = getRemoteService()->getClient();
  String value;

  if (!pClient->isConnected()) {
    log_e("Disconnected");
    return value;
  }

  int rc = 0;
  int retryCount = 1;
  TaskHandle_t cur_task = xTaskGetCurrentTaskHandle();
  ble_task_data_t taskData = {this, cur_task, 0, &value};

  do {
    rc = ble_gattc_read_long(pClient->getConnId(), m_handle, 0, BLERemoteCharacteristic::onReadCB, &taskData);
    if (rc != 0) {
      log_e("Error: Failed to read characteristic; rc=%d, %s", rc, BLEUtils::returnCodeToString(rc));
      return value;
    }

#ifdef ulTaskNotifyValueClear
    // Clear the task notification value to ensure we block
    ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    rc = taskData.rc;

    switch (rc) {
      case 0:
      case BLE_HS_EDONE: rc = 0; break;
      // Characteristic is not long-readable, return with what we have.
      case BLE_HS_ATT_ERR(BLE_ATT_ERR_ATTR_NOT_LONG):
        log_i("Attribute not long");
        rc = 0;
        break;
      case BLE_HS_ATT_ERR(BLE_ATT_ERR_INSUFFICIENT_AUTHEN):
      case BLE_HS_ATT_ERR(BLE_ATT_ERR_INSUFFICIENT_AUTHOR):
      case BLE_HS_ATT_ERR(BLE_ATT_ERR_INSUFFICIENT_ENC):
        if (retryCount && pClient->secureConnection()) {
          break;
        }
      /* Else falls through. */
      default: log_e("<< readValue rc=%d", rc); return value;
    }
  } while (rc != 0 && retryCount--);

  m_semaphoreReadCharEvt.take("readValue");
  m_value = value;
  m_rawData = (uint8_t *)calloc(value.length(), sizeof(uint8_t));
  for (size_t i = 0; i < value.length(); i++) {
    m_rawData[i] = value[i];
  }
  m_semaphoreReadCharEvt.give();

  log_d("<< readValue length: %d rc=%d", value.length(), rc);
  return value;
}  // readValue

/**
 * @brief Write the new value for the characteristic from a data buffer.
 * @param [in] data A pointer to a data buffer.
 * @param [in] length The length of the data in the data buffer.
 * @param [in] response Whether we require a response from the write.
 * @return false if not connected or cant perform write for some reason.
 */
bool BLERemoteCharacteristic::writeValue(uint8_t *data, size_t length, bool response) {
  log_d(">> writeValue(), length: %d", length);

  BLEClient *pClient = getRemoteService()->getClient();

  if (!pClient->isConnected()) {
    log_e("Disconnected");
    return false;
  }

  int rc = 0;
  int retryCount = 1;
  uint16_t mtu = ble_att_mtu(pClient->getConnId()) - 3;

  // Check if the data length is longer than we can write in one connection event.
  // If so we must do a long write which requires a response.
  if (length <= mtu && !response) {
    rc = ble_gattc_write_no_rsp_flat(pClient->getConnId(), m_handle, data, length);
    return (rc == 0);
  }

  TaskHandle_t cur_task = xTaskGetCurrentTaskHandle();
  ble_task_data_t taskData = {this, cur_task, 0, nullptr};

  do {
    if (length > mtu) {
      log_i("long write %d bytes", length);
      os_mbuf *om = ble_hs_mbuf_from_flat(data, length);
      rc = ble_gattc_write_long(pClient->getConnId(), m_handle, 0, om, BLERemoteCharacteristic::onWriteCB, &taskData);
    } else {
      rc = ble_gattc_write_flat(pClient->getConnId(), m_handle, data, length, BLERemoteCharacteristic::onWriteCB, &taskData);
    }
    if (rc != 0) {
      log_e("Error: Failed to write characteristic; rc=%d", rc);
      return false;
    }

#ifdef ulTaskNotifyValueClear
    // Clear the task notification value to ensure we block
    ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    rc = taskData.rc;

    switch (rc) {
      case 0:
      case BLE_HS_EDONE: rc = 0; break;
      case BLE_HS_ATT_ERR(BLE_ATT_ERR_ATTR_NOT_LONG):
        log_e("Long write not supported by peer; Truncating length to %d", mtu);
        retryCount++;
        length = mtu;
        break;

      case BLE_HS_ATT_ERR(BLE_ATT_ERR_INSUFFICIENT_AUTHEN):
      case BLE_HS_ATT_ERR(BLE_ATT_ERR_INSUFFICIENT_AUTHOR):
      case BLE_HS_ATT_ERR(BLE_ATT_ERR_INSUFFICIENT_ENC):
        if (retryCount && pClient->secureConnection()) {
          break;
        }
        /* Else falls through. */
      default: log_e("<< writeValue, rc: %d", rc); return false;
    }
  } while (rc != 0 && retryCount--);

  log_d("<< writeValue, rc: %d", rc);
  return (rc == 0);
}  // writeValue

/**
 * @brief Subscribe or unsubscribe for notifications or indications.
 * @param [in] val 0x00 to unsubscribe, 0x01 for notifications, 0x02 for indications.
 * @param [in] notifyCallback A callback to be invoked for a notification.
 * @param [in] response If write response required set this to true.
 * If NULL is provided then no callback is performed.
 * @return false if writing to the descriptor failed.
 */
bool BLERemoteCharacteristic::setNotify(uint16_t val, notify_callback notifyCallback, bool response) {
  log_v(">> setNotify(): %s, %02x", toString().c_str(), val);

  m_notifyCallback = notifyCallback;

