espressif/arduino-esp32/libraries/BLE/src/BLERemoteCharacteristic.cpp
  BLERemoteDescriptor *desc = getDescriptor(BLEUUID((uint16_t)0x2902));
  if (desc == nullptr) {
    log_w("<< setNotify(): Callback set, CCCD not found");
    return true;
  }

  log_d("<< setNotify()");

  response = true;  // Always write with response as per Bluetooth core specification.
  return desc->writeValue((uint8_t *)&val, 2, response);
}  // setNotify

/**
 * @brief Subscribe for notifications or indications.
 * @param [in] notifications If true, subscribe for notifications, false subscribe for indications.
 * @param [in] notifyCallback A callback to be invoked for a notification.
 * @param [in] response If true, require a write response from the descriptor write operation.
 * If NULL is provided then no callback is performed.
 * @return false if writing to the descriptor failed.
 */
bool BLERemoteCharacteristic::subscribe(bool notifications, notify_callback notifyCallback, bool response) {
  if (notifications) {
    return setNotify(0x01, notifyCallback, response);
  } else {
    return setNotify(0x02, notifyCallback, response);
  }
}  // subscribe

/**
 * @brief Unsubscribe for notifications or indications.
 * @param [in] response bool if true, require a write response from the descriptor write operation.
 * @return false if writing to the descriptor failed.
 */
bool BLERemoteCharacteristic::unsubscribe(bool response) {
  return setNotify(0x00, nullptr, response);
}  // unsubscribe

#endif

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED */
